using Tyuiu.AidemirAF.Sprint1.Task2.V13.Lib;

//ЗАДАНИЕ
//Написать программу, которая запрашивает у пользователя исхлные данные,
//выполняет указанные расчеты и печатает результат на экране.
//Расчеты: Известно расстояние в милях. Вычислить расстояние в километрах.
//Расстояние в милях (целое число)
//Расстояние в километрах (вещественное число)

namespace Tyuiu.AidemirAF.Sprint1.Task2.V13
{
    internal class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.WriteLine("*****************************************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                  *");
            Console.WriteLine("*****************************************************************************************************");

            int x;

            Console.WriteLine("Введите значение X:");
            x = Convert.ToInt32(Console.ReadLine());

            Console.WriteLine("*****************************************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                        *");
            Console.WriteLine("*****************************************************************************************************");

            Console.WriteLine("Расстояние в километрах = " + ds.ConvertMilesToKm(x));

            Console.ReadLine();
        }
    }
}
